# SQL in Python Exercise

In this exercises we will be using Jupyter and Python as our IDE for SQL. We can download the northwind database from [here](https://drive.google.com/file/d/1HCfNF5BsYUrQhhr-vnO_LFgs5THJUAh_/view?usp=sharing). Before we go to the actual tasks we will remember how we can connect to existing databases.

In [1]:
import pandas as pd
import sqlite3

In [2]:
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        return conn
    except Error as e:
        print(e)

    return conn

In [35]:
# if northwind is in the same working directory
con = create_connection("northwind.db")

> #### Warning
> in case the file is somewhere else it will still work but create new, empty database.

### Get all table names

**1. classic Python approach**

In [4]:
cursor = con.cursor()
res = cursor.execute("SELECT type, name FROM sqlite_master WHERE type='table'").fetchall()
all_tables = pd.DataFrame(res)
all_tables.columns = ["type","name"]
all_tables

    type                 name
0  table            Employees
1  table           Categories
2  table            Customers
3  table             Shippers
4  table            Suppliers
5  table               Orders
6  table             Products
7  table        Order Details
8  table          Territories
9  table  EmployeeTerritories

**2. with pandas**

In [23]:
all_tables = pd.read_sql("SELECT type, name FROM sqlite_master WHERE type='table'", con)
all_tables

     type                  name
0   table             Employees
1   table            Categories
2   table             Customers
3   table              Shippers
4   table             Suppliers
5   table                Orders
6   table              Products
7   table         Order Details
8   table           Territories
9   table   EmployeeTerritories
10  table         end_obs_dates
11  table   ads_population_hist
12  table       ads_orders_hist
13  table  ads_observation_hist

Using **read_sql** method from Pandas we can easily pull any SQL query into table format in Python.

In [8]:
orders = pd.read_sql("SELECT * FROM orders", con)
orders.ShippedDate.value_counts()

1998-04-10    8
1998-03-18    7
1998-04-24    6
1998-04-08    6
1998-01-30    6
             ..
1998-01-22    1
1996-07-10    1
1997-04-01    1
1997-02-25    1
1997-07-31    1
Name: ShippedDate, Length: 387, dtype: int64

### Task I: 
Write a query to get Product name and quantity/unit.

### Task II: 
Write a query to get the most expensive and least expensive Product (name and unit price)

### Task III: 
Write a query to count current and discontinued products.

### Task IV: 
Select all product names and their category names.

### Task V: 
Select all product names, unit price and the supplier region that don't have suppliers from USA region. (26 rows)

### Task VI: 
Create report which shows a number of orders for each month.

### Task VII:
Create report which shows total quantity of orders sold for each order.(830 rows)

### Task VIII: 
Which day of the week is the best for orders? Report it with the name of the day as well (Monday, Tuesday...)